Revit 2024 API
PanelScheduleView.IsPanelScheduleTemplate Method
 Check if this is a panel schedule template.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsPanelScheduleTemplate()
Visual Basic
Public Function IsPanelScheduleTemplate As Boolean
Visual C++
public:
bool IsPanelScheduleTemplate()
Return Value
 Check if this is a panel schedule template.
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace